Revit 2026 API

# ZoneName Property

---

Get or Set the Name of the Zone.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public override string Name { set; }
```
```vb
Public Overrides WriteOnly Property Name As String
	Set
```
```cpp
public:
virtual property String^ Name {
	void set (String^ value) override;
}
```
```fsharp
abstract Name : string with set
override Name : string with set
```

#### Property Value

String

This property is used to get or set the Name of the Zone.

#### Reference

Zone Class

Autodesk.Revit.DB.Mechanical Namespace